# RbsCurvetypeDefaultTeedownParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCurvetypeDefaultTeedownParam Property
ParameterTypeId Class See Also
---
"Tee Down"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurvetypeDefaultTeedownParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurvetypeDefaultTeedownParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurvetypeDefaultTeedownParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace